In [206]:
from pyspark.sql import SparkSession


# Spark entry point
spark = SparkSession \
    .builder \
    .appName("Aula Interativa 1 - Cientista de Dados - Apache Spark") \
    .getOrCreate()

spark.version

'3.5.1'

In [207]:
# Carregando a planilha CSV
titanic_df = spark.read.csv('C:\\Users\\Matheus Poletto\\Desktop\\Cientista de Dados\\POS XP\\BOOTCAMP CDD\\MÓDULO 2\\titanic\\titanic-partial.csv',header='True',inferSchema='True')

# Detalhes dos atributos em https://www.kaggle.com/c/titanic/data?select=train.csv
titanic_df.printSchema()

root
 |-- PassengerId: integer (nullable = true)
 |-- Pclass: integer (nullable = true)
 |-- Name: string (nullable = true)
 |-- Sex: string (nullable = true)
 |-- Age: double (nullable = true)
 |-- SibSp: integer (nullable = true)
 |-- Parch: integer (nullable = true)
 |-- Ticket: string (nullable = true)
 |-- Fare: double (nullable = true)
 |-- Cabin: string (nullable = true)
 |-- Embarked: string (nullable = true)

In [208]:
titanic_df.show()

+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|          1|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|   7.25| NULL|       S|
|          2|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|71.2833|  C85|       C|
|          3|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| NULL|       S|
|          4|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|   53.1| C123|       S|
|          5|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|   8.05| NULL|       S|
|          6|     3|    Moran, Mr. James|  male|NULL|    0|    0|          330877| 8.4583| NULL|       Q|
|          7|     1|McCarthy, Mr. Tim...|  male|54.0|    0|    0|           17463|51.8625|  E46|       S|
|          8|     3|Palsson, Master. ...|  male| 2.0|    3|    1|          349909| 21.075| NULL|       S|
|          9|     3|Johnson, Mrs. Osc...|female|27.0|    0|    2|          347742|11.1333| NULL|       S|
|         10|     2|Nasser, Mrs. Nich...|female|14.0|    1|    0|          237736|30.0708| NULL|       C|
|         11|     3|Sandstrom, Miss. ...|female| 4.0|    1|    1|         PP 9549|   16.7|   G6|       S|
|         12|     1|Bonnell, Miss. El...|female|58.0|    0|    0|          113783|  26.55| C103|       S|
|         13|     3|Saundercock, Mr. ...|  male|20.0|    0|    0|       A/5. 2151|   8.05| NULL|       S|
|         14|     3|Andersson, Mr. An...|  male|39.0|    1|    5|          347082| 31.275| NULL|       S|
|         15|     3|Vestrom, Miss. Hu...|female|14.0|    0|    0|          350406| 7.8542| NULL|       S|
|         16|     2|Hewlett, Mrs. (Ma...|female|55.0|    0|    0|          248706|   16.0| NULL|       S|
|         17|     3|Rice, Master. Eugene|  male| 2.0|    4|    1|          382652| 29.125| NULL|       Q|
|         18|     2|Williams, Mr. Cha...|  male|NULL|    0|    0|          244373|   13.0| NULL|       S|
|         19|     3|Vander Planke, Mr...|female|31.0|    1|    0|          345763|   18.0| NULL|       S|
|         20|     3|Masselmani, Mrs. ...|female|NULL|    0|    0|            2649|  7.225| NULL|       C|
+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 20 rows

In [209]:
# Carregando o arquivo JSON

survived_df = spark.read.json("C:\\Users\\Matheus Poletto\\Desktop\\Cientista de Dados\\POS XP\\BOOTCAMP CDD\\MÓDULO 2\\titanic\\titanic-survived.json")
survived_df.printSchema()
survived_df.show()

root
 |-- PassengerId: long (nullable = true)
 |-- Survived: long (nullable = true)

+-----------+--------+
|PassengerId|Survived|
+-----------+--------+
|          1|       0|
|          2|       1|
|          3|       1|
|          4|       1|
|          5|       0|
|          6|       0|
|          7|       0|
|          8|       0|
|          9|       1|
|         10|       1|
|         11|       1|
|         12|       1|
|         13|       0|
|         14|       0|
|         15|       0|
|         16|       1|
|         17|       0|
|         18|       1|
|         19|       0|
|         20|       1|
+-----------+--------+
only showing top 20 rows

In [210]:
# Juntando os dois dataframes.

titanic_df = titanic_df.join(survived_df, ["PassengerId"])

titanic_df.printSchema()

root
 |-- PassengerId: integer (nullable = true)
 |-- Pclass: integer (nullable = true)
 |-- Name: string (nullable = true)
 |-- Sex: string (nullable = true)
 |-- Age: double (nullable = true)
 |-- SibSp: integer (nullable = true)
 |-- Parch: integer (nullable = true)
 |-- Ticket: string (nullable = true)
 |-- Fare: double (nullable = true)
 |-- Cabin: string (nullable = true)
 |-- Embarked: string (nullable = true)
 |-- Survived: long (nullable = true)

In [211]:
titanic_df.count()

891

In [212]:
titanic_df.show()

+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+--------+
|PassengerId|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|Survived|
+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+--------+
|          1|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|   7.25| NULL|       S|       0|
|          2|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|71.2833|  C85|       C|       1|
|          3|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| NULL|       S|       1|
|          4|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|   53.1| C123|       S|       1|
|          5|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|   8.05| NULL|       S|       0|
|          6|     3|    Moran, Mr. James|  male|NULL|    0|    0|          330877| 8.4583| NULL|       Q|       0|
|          7|     1|McCarthy, Mr. Tim...|  male|54.0|    0|    0|           17463|51.8625|  E46|       S|       0|
|          8|     3|Palsson, Master. ...|  male| 2.0|    3|    1|          349909| 21.075| NULL|       S|       0|
|          9|     3|Johnson, Mrs. Osc...|female|27.0|    0|    2|          347742|11.1333| NULL|       S|       1|
|         10|     2|Nasser, Mrs. Nich...|female|14.0|    1|    0|          237736|30.0708| NULL|       C|       1|
|         11|     3|Sandstrom, Miss. ...|female| 4.0|    1|    1|         PP 9549|   16.7|   G6|       S|       1|
|         12|     1|Bonnell, Miss. El...|female|58.0|    0|    0|          113783|  26.55| C103|       S|       1|
|         13|     3|Saundercock, Mr. ...|  male|20.0|    0|    0|       A/5. 2151|   8.05| NULL|       S|       0|
|         14|     3|Andersson, Mr. An...|  male|39.0|    1|    5|          347082| 31.275| NULL|       S|       0|
|         15|     3|Vestrom, Miss. Hu...|female|14.0|    0|    0|          350406| 7.8542| NULL|       S|       0|
|         16|     2|Hewlett, Mrs. (Ma...|female|55.0|    0|    0|          248706|   16.0| NULL|       S|       1|
|         17|     3|Rice, Master. Eugene|  male| 2.0|    4|    1|          382652| 29.125| NULL|       Q|       0|
|         18|     2|Williams, Mr. Cha...|  male|NULL|    0|    0|          244373|   13.0| NULL|       S|       1|
|         19|     3|Vander Planke, Mr...|female|31.0|    1|    0|          345763|   18.0| NULL|       S|       0|
|         20|     3|Masselmani, Mrs. ...|female|NULL|    0|    0|            2649|  7.225| NULL|       C|       1|
+-----------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+--------+
only showing top 20 rows

In [213]:
titanic_df.select("Survived", "Name", "Pclass","Embarked").show()

+--------+--------------------+------+--------+
|Survived|                Name|Pclass|Embarked|
+--------+--------------------+------+--------+
|       0|Braund, Mr. Owen ...|     3|       S|
|       1|Cumings, Mrs. Joh...|     1|       C|
|       1|Heikkinen, Miss. ...|     3|       S|
|       1|Futrelle, Mrs. Ja...|     1|       S|
|       0|Allen, Mr. Willia...|     3|       S|
|       0|    Moran, Mr. James|     3|       Q|
|       0|McCarthy, Mr. Tim...|     1|       S|
|       0|Palsson, Master. ...|     3|       S|
|       1|Johnson, Mrs. Osc...|     3|       S|
|       1|Nasser, Mrs. Nich...|     2|       C|
|       1|Sandstrom, Miss. ...|     3|       S|
|       1|Bonnell, Miss. El...|     1|       S|
|       0|Saundercock, Mr. ...|     3|       S|
|       0|Andersson, Mr. An...|     3|       S|
|       0|Vestrom, Miss. Hu...|     3|       S|
|       1|Hewlett, Mrs. (Ma...|     2|       S|
|       0|Rice, Master. Eugene|     3|       Q|
|       1|Williams, Mr. Cha...|     2|       S|
|       0|Vander Planke, Mr...|     3|       S|
|       1|Masselmani, Mrs. ...|     3|       C|
+--------+--------------------+------+--------+
only showing top 20 rows

In [214]:
titanic_df.describe().show()

+-------+-----------------+------------------+--------------------+------+------------------+------------------+-------------------+------------------+-----------------+-----+--------+-------------------+
|summary|      PassengerId|            Pclass|                Name|   Sex|               Age|             SibSp|              Parch|            Ticket|             Fare|Cabin|Embarked|           Survived|
+-------+-----------------+------------------+--------------------+------+------------------+------------------+-------------------+------------------+-----------------+-----+--------+-------------------+
|  count|              891|               891|                 891|   891|               714|               891|                891|               891|              891|  204|     889|                891|
|   mean|            446.0| 2.308641975308642|                NULL|  NULL| 29.69911764705882|0.5230078563411896|0.38159371492704824|260318.54916792738| 32.2042079685746| NULL|    NULL| 0.3838383838383838|
| stddev|257.3538420152301|0.8360712409770491|                NULL|  NULL|14.526497332334035|1.1027434322934315| 0.8060572211299488|471609.26868834975|49.69342859718089| NULL|    NULL|0.48659245426485753|
|    min|                1|                 1|"Andersson, Mr. A...|female|              0.42|                 0|                  0|            110152|              0.0|  A10|       C|                  0|
|    max|              891|                 3|van Melkebeke, Mr...|  male|              80.0|                 8|                  6|         WE/P 5735|         512.3292|    T|       S|                  1|
+-------+-----------------+------------------+--------------------+------+------------------+------------------+-------------------+------------------+-----------------+-----+--------+-------------------+

In [215]:
titanic_df.describe('Age', 'Fare', 'Survived').show()

+-------+------------------+-----------------+-------------------+
|summary|               Age|             Fare|           Survived|
+-------+------------------+-----------------+-------------------+
|  count|               714|              891|                891|
|   mean| 29.69911764705882| 32.2042079685746| 0.3838383838383838|
| stddev|14.526497332334035|49.69342859718089|0.48659245426485753|
|    min|              0.42|              0.0|                  0|
|    max|              80.0|         512.3292|                  1|
+-------+------------------+-----------------+-------------------+

In [216]:
titanic_df.describe('Age', 'Fare', 'Survived').show()

+-------+------------------+-----------------+-------------------+
|summary|               Age|             Fare|           Survived|
+-------+------------------+-----------------+-------------------+
|  count|               714|              891|                891|
|   mean| 29.69911764705882| 32.2042079685746| 0.3838383838383838|
| stddev|14.526497332334035|49.69342859718089|0.48659245426485753|
|    min|              0.42|              0.0|                  0|
|    max|              80.0|         512.3292|                  1|
+-------+------------------+-----------------+-------------------+

In [217]:
titanic_df.select('Age', 'Fare', 'Survived').summary().show()

+-------+------------------+-----------------+-------------------+
|summary|               Age|             Fare|           Survived|
+-------+------------------+-----------------+-------------------+
|  count|               714|              891|                891|
|   mean| 29.69911764705882| 32.2042079685746| 0.3838383838383838|
| stddev|14.526497332334035|49.69342859718089|0.48659245426485753|
|    min|              0.42|              0.0|                  0|
|    25%|              20.0|           7.8958|                  0|
|    50%|              28.0|          14.4542|                  0|
|    75%|              38.0|             31.0|                  1|
|    max|              80.0|         512.3292|                  1|
+-------+------------------+-----------------+-------------------+

In [218]:
# narrow ou wide?
titanic_df.groupBy('Survived').count().show()

+--------+-----+
|Survived|count|
+--------+-----+
|       0|  549|
|       1|  342|
+--------+-----+

In [219]:
titanic_df.stat.crosstab("Sex","Survived").show()

+------------+---+---+
|Sex_Survived|  0|  1|
+------------+---+---+
|      female| 81|233|
|        male|468|109|
+------------+---+---+

In [220]:
titanic_df.groupBy("Age").count().show()

+----+-----+
| Age|count|
+----+-----+
| 8.0|    4|
|70.0|    2|
| 7.0|    3|
|20.5|    1|
|49.0|    6|
|29.0|   20|
|40.5|    2|
|64.0|    2|
|47.0|    9|
|42.0|   13|
|24.5|    1|
|44.0|    9|
|35.0|   18|
|NULL|  177|
|62.0|    4|
|18.0|   26|
|80.0|    1|
|34.5|    1|
|39.0|   14|
| 1.0|    7|
+----+-----+
only showing top 20 rows

In [221]:
titanic_df.groupBy("Pclass","Survived").count().show()

+------+--------+-----+
|Pclass|Survived|count|
+------+--------+-----+
|     1|       0|   80|
|     3|       1|  119|
|     1|       1|  136|
|     2|       1|   87|
|     3|       0|  372|
|     2|       0|   97|
+------+--------+-----+

In [222]:
titanic_df.toPandas()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,None,S,0
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,None,S,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,None,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,None,S,0
887,888,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1
888,889,3,"""Johnston, Miss. Catherine Helen """"Carrie""""""",female,NaN,1,2,W./C. 6607,23.4500,None,S,0
889,890,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1
890,891,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,None,Q,0

In [223]:
# EMBARKED
titanic_df.groupBy("Embarked").count().show()

+--------+-----+
|Embarked|count|
+--------+-----+
|       Q|   77|
|    NULL|    2|
|       C|  168|
|       S|  644|
+--------+-----+

In [224]:
# narrow ou wide?
titanic_df = titanic_df.na.fill({"Embarked" : 'S'})

In [225]:
titanic_df.groupBy("Embarked").count().show()

+--------+-----+
|Embarked|count|
+--------+-----+
|       Q|   77|
|       C|  168|
|       S|  646|
+--------+-----+

In [226]:
# AGE
titanic_df.describe('Age').show()

+-------+------------------+
|summary|               Age|
+-------+------------------+
|  count|               714|
|   mean| 29.69911764705882|
| stddev|14.526497332334035|
|    min|              0.42|
|    max|              80.0|
+-------+------------------+

In [227]:
from pyspark.sql.functions import col, regexp_extract

titanic_df = titanic_df.withColumn("Saudacao", regexp_extract(col("Name"),"([A-Za-z]+)\.",1))

titanic_df.select("Saudacao", "Name").show()

+--------+--------------------+
|Saudacao|                Name|
+--------+--------------------+
|      Mr|Braund, Mr. Owen ...|
|     Mrs|Cumings, Mrs. Joh...|
|    Miss|Heikkinen, Miss. ...|
|     Mrs|Futrelle, Mrs. Ja...|
|      Mr|Allen, Mr. Willia...|
|      Mr|    Moran, Mr. James|
|      Mr|McCarthy, Mr. Tim...|
|  Master|Palsson, Master. ...|
|     Mrs|Johnson, Mrs. Osc...|
|     Mrs|Nasser, Mrs. Nich...|
|    Miss|Sandstrom, Miss. ...|
|    Miss|Bonnell, Miss. El...|
|      Mr|Saundercock, Mr. ...|
|      Mr|Andersson, Mr. An...|
|    Miss|Vestrom, Miss. Hu...|
|     Mrs|Hewlett, Mrs. (Ma...|
|  Master|Rice, Master. Eugene|
|      Mr|Williams, Mr. Cha...|
|     Mrs|Vander Planke, Mr...|
|     Mrs|Masselmani, Mrs. ...|
+--------+--------------------+
only showing top 20 rows

<>:3: SyntaxWarning: invalid escape sequence '\.'
<>:3: SyntaxWarning: invalid escape sequence '\.'
C:\Users\Matheus Poletto\AppData\Local\Temp\ipykernel_18704\2250760982.py:3: SyntaxWarning: invalid escape sequence '\.'
  titanic_df = titanic_df.withColumn("Saudacao", regexp_extract(col("Name"),"([A-Za-z]+)\.",1))

In [228]:
titanic_df.select("Saudacao").distinct().show()

+--------+
|Saudacao|
+--------+
|     Don|
|    Miss|
|Countess|
|     Col|
|     Rev|
|    Lady|
|  Master|
|     Mme|
|    Capt|
|      Mr|
|      Dr|
|     Mrs|
|     Sir|
|Jonkheer|
|    Mlle|
|   Major|
|      Ms|
+--------+

In [229]:
titanic_df = titanic_df.replace(['Mlle','Mme', 'Ms', 'Dr','Major','Lady','Countess','Jonkheer','Col','Rev','Capt','Sir','Don'],
               ['Miss','Miss','Miss','Mr','Mr',  'Mrs',  'Mrs',  'Other',  'Other','Other','Mr','Mr','Mr'])

In [230]:
titanic_df.select("Saudacao").distinct().show()

+--------+
|Saudacao|
+--------+
|    Miss|
|   Other|
|  Master|
|      Mr|
|     Mrs|
+--------+

In [231]:
#titanic_df.groupby('Saudacao').avg('Age').collect()
from pyspark.sql.functions import avg, stddev

#titanic_df.agg(avg("Age").alias("Media"), stddev("Age").alias("DesvioPadrao")).show()

titanic_df.groupby('Saudacao').agg(avg("Age").alias("Media Idade"), stddev("Age").alias("DesvioPadrao")).show()

# Conhecimentos do cientista de dados estao aqui:
# entender Estatística (Desvio-Padrao)
# entender Computação (saber escrever o código)
# entender do Domínio (Saudacao, Master)
# https://en.wikipedia.org/wiki/Master_(form_of_address)
# criatividade do campo "saudacao"

+--------+------------------+------------------+
|Saudacao|       Media Idade|      DesvioPadrao|
+--------+------------------+------------------+
|    Miss|             21.86|12.828485240161713|
|   Other|45.888888888888886| 12.60401170703642|
|  Master| 4.574166666666667|3.6198716433439615|
|      Mr| 32.73960880195599|12.875632321937676|
|     Mrs|35.981818181818184|11.390469070881686|
+--------+------------------+------------------+

In [232]:
from pyspark.sql.functions import col

titanic_df.filter(col("Saudacao") == 'Miss').select("Name", "Age",  "Saudacao").show(5)

titanic_df.filter(titanic_df.Saudacao == 'Miss').select("Name", "Age", "Saudacao").show(5)

+--------------------+----+--------+
|                Name| Age|Saudacao|
+--------------------+----+--------+
|Heikkinen, Miss. ...|26.0|    Miss|
|Sandstrom, Miss. ...| 4.0|    Miss|
|Bonnell, Miss. El...|58.0|    Miss|
|Vestrom, Miss. Hu...|14.0|    Miss|
|"McGowan, Miss. A...|15.0|    Miss|
+--------------------+----+--------+
only showing top 5 rows

+--------------------+----+--------+
|                Name| Age|Saudacao|
+--------------------+----+--------+
|Heikkinen, Miss. ...|26.0|    Miss|
|Sandstrom, Miss. ...| 4.0|    Miss|
|Bonnell, Miss. El...|58.0|    Miss|
|Vestrom, Miss. Hu...|14.0|    Miss|
|"McGowan, Miss. A...|15.0|    Miss|
+--------------------+----+--------+
only showing top 5 rows

In [233]:
from pyspark.sql.functions import when

titanic_df = titanic_df.withColumn("Age",when((titanic_df["Saudacao"] == "Miss") & (titanic_df["Age"].isNull()), 22).otherwise(titanic_df["Age"]))
titanic_df = titanic_df.withColumn("Age",when((titanic_df["Saudacao"] == "Other") & (titanic_df["Age"].isNull()), 46).otherwise(titanic_df["Age"]))
titanic_df = titanic_df.withColumn("Age",when((titanic_df["Saudacao"] == "Master") & (titanic_df["Age"].isNull()), 5).otherwise(titanic_df["Age"]))
titanic_df = titanic_df.withColumn("Age",when((titanic_df["Saudacao"] == "Mr") & (titanic_df["Age"].isNull()), 33).otherwise(titanic_df["Age"]))
titanic_df = titanic_df.withColumn("Age",when((titanic_df["Saudacao"] == "Mrs") & (titanic_df["Age"].isNull()), 36).otherwise(titanic_df["Age"]))

In [234]:
titanic_df.filter(col("Saudacao") == 'Master').describe('Age').show()

+-------+-----------------+
|summary|              Age|
+-------+-----------------+
|  count|               40|
|   mean|          4.61675|
| stddev|3.431656090816943|
|    min|             0.42|
|    max|             12.0|
+-------+-----------------+

In [235]:
titanic_df.describe("Cabin").show()

+-------+-----+
|summary|Cabin|
+-------+-----+
|  count|  204|
|   mean| NULL|
| stddev| NULL|
|    min|  A10|
|    max|    T|
+-------+-----+

In [236]:
titanic_df = titanic_df.drop("Cabin")

titanic_df.printSchema()

root
 |-- PassengerId: integer (nullable = true)
 |-- Pclass: integer (nullable = true)
 |-- Name: string (nullable = true)
 |-- Sex: string (nullable = true)
 |-- Age: double (nullable = true)
 |-- SibSp: integer (nullable = true)
 |-- Parch: integer (nullable = true)
 |-- Ticket: string (nullable = true)
 |-- Fare: double (nullable = true)
 |-- Embarked: string (nullable = false)
 |-- Survived: long (nullable = true)
 |-- Saudacao: string (nullable = true)

In [237]:
titanic_df = titanic_df.withColumn("Family_Size",col('SibSp')+col('Parch') + 1)

In [238]:
from pyspark.sql.functions import col


titanic_df.groupBy("Family_Size").count().show()

+-----------+-----+
|Family_Size|count|
+-----------+-----+
|          1|  537|
|          6|   22|
|          3|  102|
|          5|   15|
|          4|   29|
|          8|    6|
|          7|   12|
|         11|    7|
|          2|  161|
+-----------+-----+

In [239]:
from pyspark.sql.functions import asc

titanic_df.select("Name", "Family_Size").orderBy(col("Family_Size").desc()).show()

# cientista de dados do filme
# " sage".

+--------------------+-----------+
|                Name|Family_Size|
+--------------------+-----------+
|Sage, Master. Tho...|         11|
|Sage, Miss. Const...|         11|
| Sage, Mr. Frederick|         11|
|Sage, Mr. George ...|         11|
|Sage, Miss. Stell...|         11|
|Sage, Mr. Douglas...|         11|
|"Sage, Miss. Doro...|         11|
|Goodwin, Master. ...|          8|
|Goodwin, Miss. Li...|          8|
|Goodwin, Master. ...|          8|
|Goodwin, Master. ...|          8|
|Goodwin, Mrs. Fre...|          8|
|Goodwin, Mr. Char...|          8|
|Andersson, Mr. An...|          7|
|Asplund, Mrs. Car...|          7|
|Andersson, Miss. ...|          7|
|Andersson, Miss. ...|          7|
|Asplund, Master. ...|          7|
|Asplund, Miss. Li...|          7|
|Asplund, Master. ...|          7|
+--------------------+-----------+
only showing top 20 rows

In [240]:
from pyspark.sql.functions import lit

titanic_df = titanic_df.withColumn('Alone',lit(0))

In [241]:
from pyspark.sql.functions import lit


titanic_df = titanic_df.withColumn('Alone',lit(0))
titanic_df = titanic_df.withColumn("Alone",when(titanic_df["Family_Size"] == 0, 1).otherwise(titanic_df["Alone"]))

In [242]:
titanic_df.columns

['PassengerId',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Embarked',
 'Survived',
 'Saudacao',
 'Family_Size',
 'Alone']

In [243]:
spark.conf.set("spark.sql.codegen.wholeStage", False)

titanic_df.filter(titanic_df.Age > 70).show()

+-----------+------+--------------------+----+----+-----+-----+--------+-------+--------+--------+--------+-----------+-----+
|PassengerId|Pclass|                Name| Sex| Age|SibSp|Parch|  Ticket|   Fare|Embarked|Survived|Saudacao|Family_Size|Alone|
+-----------+------+--------------------+----+----+-----+-----+--------+-------+--------+--------+--------+-----------+-----+
|         97|     1|Goldschmidt, Mr. ...|male|71.0|    0|    0|PC 17754|34.6542|       C|       0|      Mr|          1|    0|
|        117|     3|Connors, Mr. Patrick|male|70.5|    0|    0|  370369|   7.75|       Q|       0|      Mr|          1|    0|
|        494|     1|Artagaveytia, Mr....|male|71.0|    0|    0|PC 17609|49.5042|       C|       0|      Mr|          1|    0|
|        631|     1|Barkworth, Mr. Al...|male|80.0|    0|    0|   27042|   30.0|       S|       1|      Mr|          1|    0|
|        852|     3| Svensson, Mr. Johan|male|74.0|    0|    0|  347060|  7.775|       S|       0|      Mr|          1|    0|
+-----------+------+--------------------+----+----+-----+-----+--------+-------+--------+--------+--------+-----------+-----+

In [244]:
from pyspark.sql.functions import desc


titanic_df.orderBy(desc("age")).show(1)

+-----------+------+--------------------+----+----+-----+-----+------+----+--------+--------+--------+-----------+-----+
|PassengerId|Pclass|                Name| Sex| Age|SibSp|Parch|Ticket|Fare|Embarked|Survived|Saudacao|Family_Size|Alone|
+-----------+------+--------------------+----+----+-----+-----+------+----+--------+--------+--------+-----------+-----+
|        631|     1|Barkworth, Mr. Al...|male|80.0|    0|    0| 27042|30.0|       S|       1|      Mr|          1|    0|
+-----------+------+--------------------+----+----+-----+-----+------+----+--------+--------+--------+-----------+-----+
only showing top 1 row

In [245]:
from pyspark.sql.functions import asc

titanic_df.orderBy(asc("age")).show(1)

+-----------+------+--------------------+----+----+-----+-----+------+------+--------+--------+--------+-----------+-----+
|PassengerId|Pclass|                Name| Sex| Age|SibSp|Parch|Ticket|  Fare|Embarked|Survived|Saudacao|Family_Size|Alone|
+-----------+------+--------------------+----+----+-----+-----+------+------+--------+--------+--------+-----------+-----+
|        804|     3|Thomas, Master. A...|male|0.42|    0|    1|  2625|8.5167|       C|       1|  Master|          2|    0|
+-----------+------+--------------------+----+----+-----+-----+------+------+--------+--------+--------+-----------+-----+
only showing top 1 row

In [246]:
titanic_df.groupBy('survived').agg({'age': 'avg'}).show()

+--------+-----------------+
|survived|         avg(age)|
+--------+-----------------+
|       0|30.80054644808743|
|       1|28.30312865497076|
+--------+-----------------+

In [247]:
titanic_df.stat.corr("age", "fare")

0.08908669546299611

In [248]:
titanic_df.stat.corr("age", "family_size")

-0.28226043774238513

In [249]:
# https://spark.apache.org/docs/latest/api/python//reference/pyspark.sql/api/pyspark.sql.DataFrameStatFunctions.html#pyspark.sql.DataFrameStatFunctions
titanic_df.stat.crosstab("Embarked", "PClass").show()

+---------------+---+---+---+
|Embarked_PClass|  1|  2|  3|
+---------------+---+---+---+
|              Q|  2|  3| 72|
|              C| 85| 17| 66|
|              S|129|164|353|
+---------------+---+---+---+

In [250]:
# De fato a primeira classe é a mais "premium"?
titanic_df.groupBy('pclass').agg({'fare': 'avg'}).show()

+------+------------------+
|pclass|         avg(fare)|
+------+------------------+
|     1| 84.15468749999992|
|     3|13.675550101832997|
|     2| 20.66218315217391|
+------+------------------+

In [251]:
titanic_df.filter(titanic_df.Sex == 'female') \
    .groupBy('pclass')\
    .agg({'fare': 'avg'}).show()

+------+------------------+
|pclass|         avg(fare)|
+------+------------------+
|     1|106.12579787234041|
|     3|16.118809722222224|
|     2| 21.97012105263158|
+------+------------------+

In [252]:
# UDFs ajudam plugar funções complexas
# extrair o last Name

from pyspark.sql.types import StringType
from pyspark.sql.functions import udf

def getLastName(str):
    return str.split(",")[0]

getLastNameUDF = udf(lambda z:getLastName(z),StringType())   

titanic_df = titanic_df.withColumn("lastName", getLastNameUDF(titanic_df.Name))

In [254]:
titanic_df.select("lastName").distinct().show()

Py4JJavaError: An error occurred while calling o1497.showString.
: org.apache.spark.SparkException: Job aborted due to stage failure: Task 0 in stage 736.0 failed 1 times, most recent failure: Lost task 0.0 in stage 736.0 (TID 563) (DESKTOP-C2A46PP executor driver): org.apache.spark.SparkException: Python worker failed to connect back.
	at org.apache.spark.api.python.PythonWorkerFactory.createSimpleWorker(PythonWorkerFactory.scala:203)
	at org.apache.spark.api.python.PythonWorkerFactory.create(PythonWorkerFactory.scala:109)
	at org.apache.spark.SparkEnv.createPythonWorker(SparkEnv.scala:124)
	at org.apache.spark.api.python.BasePythonRunner.compute(PythonRunner.scala:174)
	at org.apache.spark.sql.execution.python.BatchEvalPythonExec.evaluate(BatchEvalPythonExec.scala:54)
	at org.apache.spark.sql.execution.python.EvalPythonExec.$anonfun$doExecute$2(EvalPythonExec.scala:131)
	at org.apache.spark.rdd.RDD.$anonfun$mapPartitions$2(RDD.scala:858)
	at org.apache.spark.rdd.RDD.$anonfun$mapPartitions$2$adapted(RDD.scala:858)
	at org.apache.spark.rdd.MapPartitionsRDD.compute(MapPartitionsRDD.scala:52)
	at org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:367)
	at org.apache.spark.rdd.RDD.iterator(RDD.scala:331)
	at org.apache.spark.rdd.MapPartitionsRDD.compute(MapPartitionsRDD.scala:52)
	at org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:367)
	at org.apache.spark.rdd.RDD.iterator(RDD.scala:331)
	at org.apache.spark.rdd.MapPartitionsRDD.compute(MapPartitionsRDD.scala:52)
	at org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:367)
	at org.apache.spark.rdd.RDD.iterator(RDD.scala:331)
	at org.apache.spark.rdd.MapPartitionsRDD.compute(MapPartitionsRDD.scala:52)
	at org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:367)
	at org.apache.spark.rdd.RDD.iterator(RDD.scala:331)
	at org.apache.spark.shuffle.ShuffleWriteProcessor.write(ShuffleWriteProcessor.scala:59)
	at org.apache.spark.scheduler.ShuffleMapTask.runTask(ShuffleMapTask.scala:104)
	at org.apache.spark.scheduler.ShuffleMapTask.runTask(ShuffleMapTask.scala:54)
	at org.apache.spark.TaskContext.runTaskWithListeners(TaskContext.scala:166)
	at org.apache.spark.scheduler.Task.run(Task.scala:141)
	at org.apache.spark.executor.Executor$TaskRunner.$anonfun$run$4(Executor.scala:620)
	at org.apache.spark.util.SparkErrorUtils.tryWithSafeFinally(SparkErrorUtils.scala:64)
	at org.apache.spark.util.SparkErrorUtils.tryWithSafeFinally$(SparkErrorUtils.scala:61)
	at org.apache.spark.util.Utils$.tryWithSafeFinally(Utils.scala:94)
	at org.apache.spark.executor.Executor$TaskRunner.run(Executor.scala:623)
	at java.util.concurrent.ThreadPoolExecutor.runWorker(Unknown Source)
	at java.util.concurrent.ThreadPoolExecutor$Worker.run(Unknown Source)
	at java.lang.Thread.run(Unknown Source)
Caused by: java.net.SocketTimeoutException: Accept timed out
	at java.net.DualStackPlainSocketImpl.waitForNewConnection(Native Method)
	at java.net.DualStackPlainSocketImpl.socketAccept(Unknown Source)
	at java.net.AbstractPlainSocketImpl.accept(Unknown Source)
	at java.net.PlainSocketImpl.accept(Unknown Source)
	at java.net.ServerSocket.implAccept(Unknown Source)
	at java.net.ServerSocket.accept(Unknown Source)
	at org.apache.spark.api.python.PythonWorkerFactory.createSimpleWorker(PythonWorkerFactory.scala:190)
	... 32 more

Driver stacktrace:
	at org.apache.spark.scheduler.DAGScheduler.failJobAndIndependentStages(DAGScheduler.scala:2856)
	at org.apache.spark.scheduler.DAGScheduler.$anonfun$abortStage$2(DAGScheduler.scala:2792)
	at org.apache.spark.scheduler.DAGScheduler.$anonfun$abortStage$2$adapted(DAGScheduler.scala:2791)
	at scala.collection.mutable.ResizableArray.foreach(ResizableArray.scala:62)
	at scala.collection.mutable.ResizableArray.foreach$(ResizableArray.scala:55)
	at scala.collection.mutable.ArrayBuffer.foreach(ArrayBuffer.scala:49)
	at org.apache.spark.scheduler.DAGScheduler.abortStage(DAGScheduler.scala:2791)
	at org.apache.spark.scheduler.DAGScheduler.$anonfun$handleTaskSetFailed$1(DAGScheduler.scala:1247)
	at org.apache.spark.scheduler.DAGScheduler.$anonfun$handleTaskSetFailed$1$adapted(DAGScheduler.scala:1247)
	at scala.Option.foreach(Option.scala:407)
	at org.apache.spark.scheduler.DAGScheduler.handleTaskSetFailed(DAGScheduler.scala:1247)
	at org.apache.spark.scheduler.DAGSchedulerEventProcessLoop.doOnReceive(DAGScheduler.scala:3060)
	at org.apache.spark.scheduler.DAGSchedulerEventProcessLoop.onReceive(DAGScheduler.scala:2994)
	at org.apache.spark.scheduler.DAGSchedulerEventProcessLoop.onReceive(DAGScheduler.scala:2983)
	at org.apache.spark.util.EventLoop$$anon$1.run(EventLoop.scala:49)
Caused by: org.apache.spark.SparkException: Python worker failed to connect back.
	at org.apache.spark.api.python.PythonWorkerFactory.createSimpleWorker(PythonWorkerFactory.scala:203)
	at org.apache.spark.api.python.PythonWorkerFactory.create(PythonWorkerFactory.scala:109)
	at org.apache.spark.SparkEnv.createPythonWorker(SparkEnv.scala:124)
	at org.apache.spark.api.python.BasePythonRunner.compute(PythonRunner.scala:174)
	at org.apache.spark.sql.execution.python.BatchEvalPythonExec.evaluate(BatchEvalPythonExec.scala:54)
	at org.apache.spark.sql.execution.python.EvalPythonExec.$anonfun$doExecute$2(EvalPythonExec.scala:131)
	at org.apache.spark.rdd.RDD.$anonfun$mapPartitions$2(RDD.scala:858)
	at org.apache.spark.rdd.RDD.$anonfun$mapPartitions$2$adapted(RDD.scala:858)
	at org.apache.spark.rdd.MapPartitionsRDD.compute(MapPartitionsRDD.scala:52)
	at org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:367)
	at org.apache.spark.rdd.RDD.iterator(RDD.scala:331)
	at org.apache.spark.rdd.MapPartitionsRDD.compute(MapPartitionsRDD.scala:52)
	at org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:367)
	at org.apache.spark.rdd.RDD.iterator(RDD.scala:331)
	at org.apache.spark.rdd.MapPartitionsRDD.compute(MapPartitionsRDD.scala:52)
	at org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:367)
	at org.apache.spark.rdd.RDD.iterator(RDD.scala:331)
	at org.apache.spark.rdd.MapPartitionsRDD.compute(MapPartitionsRDD.scala:52)
	at org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:367)
	at org.apache.spark.rdd.RDD.iterator(RDD.scala:331)
	at org.apache.spark.shuffle.ShuffleWriteProcessor.write(ShuffleWriteProcessor.scala:59)
	at org.apache.spark.scheduler.ShuffleMapTask.runTask(ShuffleMapTask.scala:104)
	at org.apache.spark.scheduler.ShuffleMapTask.runTask(ShuffleMapTask.scala:54)
	at org.apache.spark.TaskContext.runTaskWithListeners(TaskContext.scala:166)
	at org.apache.spark.scheduler.Task.run(Task.scala:141)
	at org.apache.spark.executor.Executor$TaskRunner.$anonfun$run$4(Executor.scala:620)
	at org.apache.spark.util.SparkErrorUtils.tryWithSafeFinally(SparkErrorUtils.scala:64)
	at org.apache.spark.util.SparkErrorUtils.tryWithSafeFinally$(SparkErrorUtils.scala:61)
	at org.apache.spark.util.Utils$.tryWithSafeFinally(Utils.scala:94)
	at org.apache.spark.executor.Executor$TaskRunner.run(Executor.scala:623)
	at java.util.concurrent.ThreadPoolExecutor.runWorker(Unknown Source)
	at java.util.concurrent.ThreadPoolExecutor$Worker.run(Unknown Source)
	at java.lang.Thread.run(Unknown Source)
Caused by: java.net.SocketTimeoutException: Accept timed out
	at java.net.DualStackPlainSocketImpl.waitForNewConnection(Native Method)
	at java.net.DualStackPlainSocketImpl.socketAccept(Unknown Source)
	at java.net.AbstractPlainSocketImpl.accept(Unknown Source)
	at java.net.PlainSocketImpl.accept(Unknown Source)
	at java.net.ServerSocket.implAccept(Unknown Source)
	at java.net.ServerSocket.accept(Unknown Source)
	at org.apache.spark.api.python.PythonWorkerFactory.createSimpleWorker(PythonWorkerFactory.scala:190)
	... 32 more

In [ ]:
titanic_df.groupBy("lastName").count().show()

In [ ]:
# extrair o last Name

from pyspark.sql.types import StringType
from pyspark.sql.functions import udf

def getLastNameFirstCharacter(str):
    return str.split(",")[0][0]

getLastNameFirstCharacterUDF = udf(lambda z:getLastNameFirstCharacter(z),StringType())   

titanic_df.withColumn("lastNameFirstCharacter", getLastNameFirstCharacterUDF(titanic_df.Name)) \
    .groupBy("lastNameFirstCharacter") \
    .count().sort("count", ascending=False) \
    .show()